app/Controllers/Saveuserimg.php

    public function index($id)
    {
        $data['img'] = $this->request->getFile('foto-perfil');
        $data['user_id']=$id;
        $userimgModel = new UserImgModel();
        $userimgModel->insert($data);
---
INSERT INTO `auth_user_img` (`img`, `created_at`, `updated_at`) VALUES ('C:\\xampp\\tmp\\php5EFA.tmp', '2024-01-17 21:07:11', '2024-01-17 21:07:11')