sistema/app/Controllers/Clients.php

SELECT *
FROM `clients`
---
    public function index()
    {
        $ClientsModel = new ClientsModel();
        $data['clients'] = $ClientsModel
            ->get()->getResultArray();